{
  "_name_or_path": "valhalla/t5-small-e2e-qg",
  "architectures": [
    "T5ForConditionalGeneration"
  ],
  "d_ff": 2048,
  "d_kv": 64,
  "d_model": 512,
  "decoder_start_token_id": 0,
  "dropout_rate": 0.1,
  "eos_token_id": 1,
  "feed_forward_proj": "relu",
  "initializer_factor": 1.0,
  "is_encoder_decoder": true,
  "layer_norm_epsilon": 1e-06,
  "model_type": "t5",
  "n_positions": 512,
  "num_decoder_layers": 6,
  "num_heads": 8,
  "num_layers": 6,
  "output_past": true,
  "pad_token_id": 0,
  "relative_attention_num_buckets": 32,
  "task_specific_params": {
    "summarization": {
      "early_stopping": true,
      "length_penalty": 1.5,
      "max_length": 256,
      "no_repeat_ngram_size": 3,
      "num_beams": 4,
      "prefix": "generate questions: "
    },
    "translation_en_to_de": {
      "early_stopping": true,
      "length_penalty": 1.5,
      "max_length": 256,
      "no_repeat_ngram_size": 3,
      "num_beams": 4,
      "prefix": "generate questions: "
    },
    "translation_en_to_fr": {
      "early_stopping": true,
      "length_penalty": 1.5,
      "max_length": 256,
      "no_repeat_ngram_size": 3,
      "num_beams": 4,
      "prefix": "generate questions: "
    },
    "translation_en_to_ro": {
      "early_stopping": true,
      "length_penalty": 1.5,
      "max_length": 256,
      "no_repeat_ngram_size": 3,
      "num_beams": 4,
      "prefix": "generate questions: "
    }
  },
  "torch_dtype": "float32",
  "transformers_version": "4.16.2",
  "use_cache": true,
  "vocab_size": 32102
}
